app/Controllers/Pengawasan.php

    public function tambah()
    {
        $KMes2 = new MKmes2();
        $Aspek = new MNilaiModel();
        $data = [
            'units'     => $KMes2->findAll(),
            'aspeks'    => $Aspek->sub_aspek(),
        ];
---
SELECT *
FROM `km_es2`