app/Models/MNilaiModel.php

    public function sub_aspek()
    {
        return $this->db->table('km_ai_subkategori_up')
            ->select('km_ai_subkategori_up.id as id, kategori, sub_kategori, bobot_subkategori, nilai_standar_subkategori')
            ->join('km_ai_kategori_up', 'km_ai_subkategori_up.id_kategori=km_ai_kategori_up.id')
            ->get()->getResultArray();
---
SELECT `km_ai_subkategori_up`.`id` as `id`, `kategori`, `sub_kategori`, `bobot_subkategori`, `nilai_standar_subkategori`
FROM `km_ai_subkategori_up`
JOIN `km_ai_kategori_up` ON `km_ai_subkategori_up`.`id_kategori`=`km_ai_kategori_up`.`id`