app/Models/MNilaiAski.php

SELECT `ev_nilai_aski_up`.`id` as `id`, `nama_es2`, `nilai_akhir`
FROM `ev_nilai_aski_up`
LEFT JOIN `km_es2` ON `ev_nilai_aski_up`.`id_es2`=`km_es2`.`id`
ORDER BY `km_es2`.`id`
---
    public function joinData()
    {
        return $this->select('ev_nilai_aski_up.id as id, nama_es2, nilai_akhir')
            ->join('km_es2', 'ev_nilai_aski_up.id_es2=km_es2.id', 'left')
            ->orderBy('km_es2.id')
            ->get()->getResultArray();