app/Models/MUser.php

	public function dataUser($id_u)
	{
		return $this->db->table('dd_hak_unit')
			->join('km_es2', 'dd_hak_unit.parameter_unit = km_es2.id', 'left')
			->where('dd_hak_unit.id_user', $id_u)
			->get()->getRowArray();
---
SELECT *
FROM `dd_hak_unit`
LEFT JOIN `km_es2` ON `dd_hak_unit`.`parameter_unit` = `km_es2`.`id`
WHERE `dd_hak_unit`.`id_user` = '1'